---
kind: property
id: P:Autodesk.Revit.DB.FamilySizeTable.NumberOfColumns
source: html/5f69eb16-01f0-e6db-741e-cca860c51be5.htm
---
# Autodesk.Revit.DB.FamilySizeTable.NumberOfColumns Property

Number of columns in the table.

## Syntax (C#)
```csharp
public int NumberOfColumns { get; }
```